{
    "news": [
        {
            "id": "1",
            "title": "Presiden Mengadakan KTT Darurat",
            "content": "Presiden memimpin pertemuan darurat yang dihadiri oleh para pemimpin dunia. Topik utama pertemuan ini adalah membahas situasi geopolitik yang semakin memanas dan potensi dampaknya terhadap stabilitas global.\n\nSelain itu, KTT ini juga menjadi ajang diskusi untuk menyusun strategi bersama menghadapi isu perubahan iklim yang semakin mendesak. Kesepakatan awal telah dicapai untuk meningkatkan kerja sama antarnegara dalam bidang energi terbarukan. Presiden memimpin pertemuan darurat yang dihadiri oleh para pemimpin dunia. Topik utama pertemuan ini adalah membahas situasi geopolitik yang semakin memanas dan potensi dampaknya terhadap stabilitas global.\n\nSelain itu, KTT ini juga menjadi ajang diskusi untuk menyusun strategi bersama menghadapi isu perubahan iklim yang semakin mendesak. Kesepakatan awal telah dicapai untuk meningkatkan kerja sama antarnegara dalam bidang energi terbarukan.",
            "category": "Politik",
            "imageUrl": "https://setkab.go.id/wp-content/uploads/2022/11/Jelang-KTT-G20-Presiden-Jokowi-Gelar-Pertemuan-Bilateral-dengan-Sejumlah-Pemimpin-Negara.jpeg"
        },
        {
            "id": "2",
            "title": "Inovasi Teknologi Terbaru Diluncurkan",
            "content": "Sebuah startup lokal meluncurkan teknologi berbasis kecerdasan buatan yang diklaim mampu meningkatkan efisiensi kerja hingga 50%. Teknologi ini menawarkan solusi otomatisasi yang dapat diterapkan di berbagai industri, mulai dari manufaktur hingga pendidikan.\n\nPeluncuran ini mendapat sambutan positif dari komunitas teknologi internasional. Beberapa investor besar bahkan menunjukkan minat untuk mendukung pengembangan lebih lanjut dari teknologi tersebut. Sebuah startup lokal meluncurkan teknologi berbasis kecerdasan buatan yang diklaim mampu meningkatkan efisiensi kerja hingga 50%. Teknologi ini menawarkan solusi otomatisasi yang dapat diterapkan di berbagai industri, mulai dari manufaktur hingga pendidikan.\n\nPeluncuran ini mendapat sambutan positif dari komunitas teknologi internasional. Beberapa investor besar bahkan menunjukkan minat untuk mendukung pengembangan lebih lanjut dari teknologi tersebut.",
            "category": "Teknologi",
            "imageUrl": "https://static.promediateknologi.id/crop/0x0:0x0/0x0/webp/photo/p3/66/2024/09/10/FotoJet-59-2730275576.png"
        },
        {
            "id": "3",
            "title": "Penyanyi Pop Top Dunia Merilis Album Baru",
            "content": "Album terbaru dari penyanyi pop ternama berhasil memecahkan rekor penjualan dalam minggu pertama. Lagu-lagu dalam album ini menawarkan kombinasi menarik antara genre pop modern dan elemen musik klasik.\n\nBanyak kritikus musik memuji album ini karena kualitas produksinya yang luar biasa. Para penggemar juga menyambut antusias pengumuman tur dunia yang akan segera dilaksanakan. Album terbaru dari penyanyi pop ternama berhasil memecahkan rekor penjualan dalam minggu pertama. Lagu-lagu dalam album ini menawarkan kombinasi menarik antara genre pop modern dan elemen musik klasik.\n\nBanyak kritikus musik memuji album ini karena kualitas produksinya yang luar biasa. Para penggemar juga menyambut antusias pengumuman tur dunia yang akan segera dilaksanakan.",
            "category": "Hiburan",
            "imageUrl": "https://static.promediateknologi.id/crop/0x0:0x0/0x0/webp/photo/p2/01/2023/11/05/19-Musik-Baru-Awal-Nov-466103166.jpg"
        },
        {
            "id": "4",
            "title": "Liga Champions: Pertandingan Sengit",
            "content": "Liga Champions menyuguhkan pertandingan epik antara dua tim besar Eropa. Kedua tim menunjukkan performa terbaiknya, membuat laga ini menjadi salah satu yang paling menghibur musim ini.\n\nPertandingan tersebut akhirnya dimenangkan oleh tim yang lebih unggul dalam serangan balik. Para penggemar berharap dapat melihat pertandingan yang sama serunya di babak final. Liga Champions menyuguhkan pertandingan epik antara dua tim besar Eropa. Kedua tim menunjukkan performa terbaiknya, membuat laga ini menjadi salah satu yang paling menghibur musim ini.\n\nPertandingan tersebut akhirnya dimenangkan oleh tim yang lebih unggul dalam serangan balik. Para penggemar berharap dapat melihat pertandingan yang sama serunya di babak final.",
            "category": "Olahraga",
            "imageUrl": "https://static.promediateknologi.id/crop/0x0:0x0/750x500/webp/photo/p2/136/2023/11/29/library_upload_21_2023_11_996x664_untitled-2_f8c9ca0-1793808146.jpg"
        },
        {
            "id": "5",
            "title": "Penemuan Fosil Dinosaurus Baru",
            "content": "Para ilmuwan berhasil menemukan fosil spesies dinosaurus baru yang belum pernah diidentifikasi sebelumnya. Fosil ini ditemukan di wilayah terpencil yang sebelumnya dianggap tidak memiliki jejak kehidupan prasejarah.\n\nPenemuan ini membuka peluang baru dalam penelitian evolusi hewan purba. Tim peneliti berharap dapat melakukan penggalian lanjutan untuk menemukan lebih banyak bukti mengenai kehidupan dinosaurus ini. Para ilmuwan berhasil menemukan fosil spesies dinosaurus baru yang belum pernah diidentifikasi sebelumnya. Fosil ini ditemukan di wilayah terpencil yang sebelumnya dianggap tidak memiliki jejak kehidupan prasejarah.\n\nPenemuan ini membuka peluang baru dalam penelitian evolusi hewan purba. Tim peneliti berharap dapat melakukan penggalian lanjutan untuk menemukan lebih banyak bukti mengenai kehidupan dinosaurus ini.",
            "category": "Ilmu Pengetahuan",
            "imageUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSCX0N67PGNH7nsvjqQ4I5ZQus0GDXBo4F1hQ&s"
        },
        {
            "id": "6",
            "title": "Perekonomian Nasional Tumbuh Pesat",
            "content": "Data terbaru menunjukkan bahwa pertumbuhan ekonomi nasional mengalami peningkatan signifikan pada kuartal terakhir. Hal ini didorong oleh kenaikan sektor ekspor dan peningkatan konsumsi domestik.\n\nPara analis memprediksi bahwa tren positif ini akan terus berlanjut jika kebijakan ekonomi tetap mendukung. Pemerintah juga berencana untuk memperluas program insentif guna mendorong investasi. Data terbaru menunjukkan bahwa pertumbuhan ekonomi nasional mengalami peningkatan signifikan pada kuartal terakhir. Hal ini didorong oleh kenaikan sektor ekspor dan peningkatan konsumsi domestik.\n\nPara analis memprediksi bahwa tren positif ini akan terus berlanjut jika kebijakan ekonomi tetap mendukung. Pemerintah juga berencana untuk memperluas program insentif guna mendorong investasi.",
            "category": "Ekonomi",
            "imageUrl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRfLIRvOdV2KGf7DHofLC9dHecVPxw_1zRKBg5TL_tWD9Zu7acMA9YfOTS-Uf0hWPtmEew&usqp=CAU"
        },
        {
            "id": "7",
            "title": "Kebakaran Hutan Terjadi di Beberapa Wilayah",
            "content": "Beberapa wilayah dilaporkan mengalami kebakaran hutan yang cukup parah akibat musim kemarau panjang. Petugas pemadam kebakaran terus bekerja keras untuk mengendalikan api agar tidak menyebar lebih luas.\n\nMasyarakat sekitar juga diminta untuk waspada dan menghindari aktivitas yang dapat memicu kebakaran. Pemerintah sedang mempertimbangkan pengadaan alat pemadam kebakaran yang lebih canggih untuk masa depan. Beberapa wilayah dilaporkan mengalami kebakaran hutan yang cukup parah akibat musim kemarau panjang. Petugas pemadam kebakaran terus bekerja keras untuk mengendalikan api agar tidak menyebar lebih luas.\n\nMasyarakat sekitar juga diminta untuk waspada dan menghindari aktivitas yang dapat memicu kebakaran. Pemerintah sedang mempertimbangkan pengadaan alat pemadam kebakaran yang lebih canggih untuk masa depan.",
            "category": "Lingkungan",
            "imageUrl": "https://assets.bharian.com.my/images/articles/US-ENVIRONMENT-CLIMATE-FIRE_1722062047.jpg"
        },
        {
            "id": "8",
            "title": "Festival Budaya Tahunan Dihadiri Ribuan Orang",
            "content": "Festival budaya tahunan kembali digelar dengan menghadirkan berbagai pertunjukan seni dan budaya tradisional. Acara ini menarik ribuan pengunjung, baik dari dalam maupun luar negeri.\n\nSelain hiburan, festival ini juga menjadi ajang untuk mempromosikan produk lokal kepada pasar internasional. Pemerintah daerah berharap festival ini dapat meningkatkan kesadaran masyarakat terhadap kekayaan budaya bangsa. Festival budaya tahunan kembali digelar dengan menghadirkan berbagai pertunjukan seni dan budaya tradisional. Acara ini menarik ribuan pengunjung, baik dari dalam maupun luar negeri.\n\nSelain hiburan, festival ini juga menjadi ajang untuk mempromosikan produk lokal kepada pasar internasional. Pemerintah daerah berharap festival ini dapat meningkatkan kesadaran masyarakat terhadap kekayaan budaya bangsa.",
            "category": "Budaya",
            "imageUrl": "https://cdn.antaranews.com/cache/1200x800/2013/01/20130101Parade-Tahun-Baru311212-4.jpg"
        },
        {
            "id": "9",
            "title": "Tips Kesehatan: Makan Sehat dan Tetap Aktif",
            "content": "Para ahli kesehatan menyarankan untuk mengonsumsi makanan bergizi seimbang dan berolahraga secara teratur. Pola hidup sehat ini dapat membantu meningkatkan daya tahan tubuh dan mencegah berbagai penyakit.\n\nBeberapa tips sederhana yang bisa diikuti adalah memperbanyak makan sayur dan buah, serta meluangkan waktu untuk berjalan kaki setiap hari. Dengan disiplin, kesehatan tubuh dapat terjaga dengan optimal. Para ahli kesehatan menyarankan untuk mengonsumsi makanan bergizi seimbang dan berolahraga secara teratur. Pola hidup sehat ini dapat membantu meningkatkan daya tahan tubuh dan mencegah berbagai penyakit.\n\nBeberapa tips sederhana yang bisa diikuti adalah memperbanyak makan sayur dan buah, serta meluangkan waktu untuk berjalan kaki setiap hari. Dengan disiplin, kesehatan tubuh dapat terjaga dengan optimal.",
            "category": "Kesehatan",
            "imageUrl": "https://res.cloudinary.com/dk0z4ums3/image/upload/v1594622096/attached_image/ini-makanan-sehat-yang-perlu-dikonsumsi-setiap-hari.jpg"
        },
        {
            "id": "10",
            "title": "Startup Lokal Raih Pendanaan Seri B",
            "content": "Startup teknologi lokal berhasil mendapatkan pendanaan Seri B senilai jutaan dolar. Dana ini akan digunakan untuk memperluas jangkauan produk ke pasar internasional.\n\nPara pendiri startup optimis bahwa pendanaan ini akan membawa perusahaan mereka ke level berikutnya. Investor juga yakin dengan potensi besar startup ini dalam menciptakan inovasi di bidang teknologi. Startup teknologi lokal berhasil mendapatkan pendanaan Seri B senilai jutaan dolar. Dana ini akan digunakan untuk memperluas jangkauan produk ke pasar internasional.\n\nPara pendiri startup optimis bahwa pendanaan ini akan membawa perusahaan mereka ke level berikutnya. Investor juga yakin dengan potensi besar startup ini dalam menciptakan inovasi di bidang teknologi.",
            "category": "Bisnis",
            "imageUrl": "https://static.republika.co.id/uploads/images/inpicture_slide/evermos-berhasil-mengumpulkan-dana-sebesar-us-39_230527224439-816.jpg"
        }
    ],
    "users": [
        {
            "idpengguna": "1",
            "nama": "Ahmad",
            "username": "ahmad",
            "password": "ahmad123"
        },
        {
            "idpengguna": "2",
            "nama": "Susan",
            "username": "susan",
            "password": "susan123"
        },
        {
            "idpengguna": "3",
            "nama": "sunko",
            "username": "sunko",
            "password": "sunko123"
        }
    ]
}